Revit 2024 API
RoutingPreferenceRule.RoutingPreferenceManager Property
 Gets the routing preference manager that owns this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RoutingPreferenceManager RoutingPreferenceManager { get; }
Visual Basic
Public ReadOnly Property RoutingPreferenceManager As RoutingPreferenceManager
	Get
Visual C++
public:
property RoutingPreferenceManager^ RoutingPreferenceManager {
	RoutingPreferenceManager^ get ();
}
See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace